Tekla.Structures.Dialog.FormBase.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
If, for some reason, the connection has been lost, the method will return false. Currently,
there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Dialog.FormBase.WriteToDataStack(Tekla.Structures.DialogInternal.DialogDataStorageBase)
dataStorage: The data storage to write to.

Tekla.Structures.Dialog.FormBase.LoadValuesFromStorageToStack(System.String,Tekla.Structures.DialogInternal.DialogDataStorageBase)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
FileName: The name of the file.
DataStorage: The datastorage of the dialog.